xdg/emacs/init.org
#+title: GNU Emacs Configuration
#+startup: fold indent
#+property: header-args:emacs-lisp :tangle init.el

* Early Init
The early init config should be extremely fast and tiny, with only absolutely necessary config.
#+begin_src emacs-lisp :tangle early-init.el
  ;; -*- lexical-binding: t; -*-

  ;; Startup speed, annoyance suppression
  (setq gc-cons-threshold 10000000)
  (setq byte-compile-warnings '(not obsolete))
  (setq warning-suppress-log-types '((comp) (bytecomp)))
  (setq native-comp-async-report-warnings-errors 'silent)

  ;; Silence stupid startup message
  (setq inhibit-startup-echo-area-message (user-login-name))
  (setq inhibit-startup-message t)

  ;; Default frame configuration: full screen, good-looking title bar on macOS
  (setq frame-resize-pixelwise t)
  (setq frame-inhibit-implied-resize t)
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (setq default-frame-alist '((fullscreen . maximized)
                              (ns-transparent-titlebar . t)))

  ;; Option key is super.  Command key is meta.
  (when (eq system-type 'darwin)
    (setq mac-command-modifier 'meta)
    (setq mac-option-modifier 'super) ; make opt key do Super
    (setq ns-pop-up-frames nil))

  ;; test
  (setenv "LIBRARY_PATH" "/opt/homebrew/lib/gcc/15:/opt/homebrew/lib/gcc/16/gcc/aarch64-apple-darwin24/15")
#+end_src

* General Emacs behaviour
** Lexical Binding
#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-
#+end_src

** Package Repository
Tell emacs where to look to find packages. By default it only knows about the official GNU repository, but nowadays most packages are hosted on MELPA.

#+begin_src emacs-lisp
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (package-initialize)
#+end_src

Always ensure effectively inserts =:ensure t= into every =use-package= stanza.  This means that if the package isn't already installed, it will automatically download and install it.
This is great for new setups so you don't have to =package-install= each package manually.

#+begin_src emacs-lisp
  (setq use-package-always-ensure 't)
#+end_src

** Delight

Delight allows you to hide or minimize all the minor modes in the modeline.  I add it to =use-package= declarations so that it's always hidden, like so:

#+begin_src emacs-lisp
  (use-package delight)
#+end_src

** Autorevert

#+begin_src emacs-lisp
  (use-package autorevert :delight auto-revert-mode)
#+end_src

** Yes or no prompt

Instead of typing out "yes" or "no" when prompted, "y" or "n" does just fine.

#+begin_src emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

** Display column number

Shows (line number, column-number) in the modeline.

#+begin_src emacs-lisp
  (setq column-number-mode t)
#+end_src

** Dired
#+begin_src emacs-lisp
  (put 'dired-find-alternate-file 'disabled nil)
#+end_src

*** Nerd icons dired
#+begin_src emacs-lisp
  (use-package nerd-icons-dired :hook dired-mode)
#+end_src

* Clean up littering

By default Emacs likes to leave random files in places like the home directory or in the top level of your config.

** Custom file

The custom file is where Emacs saves any setting that's been =Customized=.  By default it puts it at the end of your config file, but that can easily mess up version control with its constant changes.

I find it's easier to put it in its own dedicated file.  Here we tell it where it lives, then load it.

#+begin_src emacs-lisp
  (setq custom-file (concat user-emacs-directory "custom.el"))
  (load custom-file 'noerror)
#+end_src

** Backup files

#+begin_src emacs-lisp
  (setq backup-directory-alist '(("." . "~/.config/emacs/backup"))
        backup-by-copying t    ; Don't delink hardlinks
        version-control t      ; Use version numbers on backups
        delete-old-versions t  ; Automatically delete excess backups
        kept-new-versions 20   ; how many of the newest versions to keep
        kept-old-versions 5    ; and how many of the old
        )
#+end_src

** Auto-save

Put autosave files in their own directory.

#+begin_src emacs-lisp
  (setq auto-save-file-name-transforms '((".*" "~/.config/emacs/autosave/" t)))
#+end_src

** Lock files

Lock files just get in the way, and I've found them pretty much useless.

#+begin_src emacs-lisp
  (setq create-lockfiles nil)
#+end_src

* Programming Languages
** Flymake
#+begin_src emacs-lisp
  (use-package flymake
    :custom
    (flymake-mode-line-lighter "")

    :bind
    (:map flymake-mode-map
          ("C-c C-n" . flymake-goto-next-error)
  	("C-c C-p" . flymake-goto-prev-error)))
#+end_src

** Org Mode

Lots going on here, but we want prose to be =variable pitch= and the code blocks to be =fixed pitch=.

#+begin_src emacs-lisp
  (use-package org
    :ensure nil
    :hook
    (org-mode . variable-pitch-mode)
    (org-mode . visual-line-mode)

    :custom
    (org-hide-emphasis-markers t)

    :custom-face
    (org-document-title ((t (:height 2.0 :weight light :family "Kalam"))))
    (org-level-1 ((t (:height 1.2))))
    (org-level-2 ((t (:height 1.2))))
    (org-level-3 ((t (:height 1.2))))
    (org-level-4 ((t (:height 1.2))))
    (org-level-5 ((t (:height 1.2))))

    :init
    (require 'org)
    (dolist (item '(("sh" . "src sh")
                    ("bsh" . "src bash")
                    ("em" . "src emacs-lisp")
                    ("li" . "src lisp")
                    ("el" . "src elixir")
                    ("ts" . "src typescript")
                    ("py" . "src python")
                    ("yaml" . "src yaml")
                    ("json" . "src json")))
      (add-to-list 'org-structure-template-alist item)))
#+end_src

*** Org-modern
#+begin_src emacs-lisp
  (use-package org-modern
    :after org
    :config (global-org-modern-mode)
    :custom (org-modern-star 'replace))
#+end_src

*** Org-appear
#+begin_src emacs-lisp
  (use-package org-appear
    :hook (org-mode . org-appear-mode)
    :config
    (setq org-appear-autosubmarkers t
          org-appear-autoentities t
          org-appear-autolinks t
          org-appear-inside-latex t))
#+end_src

*** Org Capture and Agenda
#+begin_src emacs-lisp
  (use-package org
    :ensure nil
    :config
    (make-directory "~/org/notes/" :parents)

    (setq org-capture-templates
          '(("n" "Note" entry (file+olp+datetree "~/org/notes/daily.org")
             "* %U %^{Title} %^g\n%?\n\n%i"
             :empty-lines 1)))

    :bind ("C-c c" . org-capture))
#+end_src

#+begin_src emacs-lisp
  (use-package org-agenda
    :ensure nil
    :no-require t
    :custom (org-agenda-files '("~/org/notes/"))
    :bind ("C-c a" . org-agenda))
#+end_src

** Markdown

#+begin_src emacs-lisp
  (use-package markdown-ts-mode
    :mode
    (("README\\.md\\'" . gfm-mode)
     ("\\.livemd\\'" . gfm-mode))
    :custom
    (markdown-fontify-code-blocks-natively t)
    :hook
    (markdown-mode . olivetti-mode)
    (markdown-mode . variable-pitch-mode))
#+end_src

*** Eldoc

Eldoc is a help buffer that shows documentation about a piece of code.  I like to style it so that prose is variable pitch and code is fixed pitch.

#+begin_src emacs-lisp
  (use-package eldoc
    :delight eldoc-mode
    :custom (help-window-select t)
    :hook
    (eldoc-mode . (lambda ()
                    (set-face-attribute 'markdown-code-face nil :inherit 'fixed-pitch)
                    (set-face-attribute 'markdown-pre-face nil :inherit 'fixed-pitch)
                    (if (string-match-p "\\*eldoc\\*" (buffer-name)) (variable-pitch-mode t)))))
#+end_src

#+begin_src emacs-lisp
(setq help-window-select t)
#+end_src

*** Olivetti
Olivetti is usually used for a distraction free writing environment.  But I use it to center the buffer content in markdown files.
#+begin_src emacs-lisp
  (use-package olivetti
    :delight
    :custom (olivetti-body-width 105))
#+end_src

** Prog mode
#+begin_src emacs-lisp
  (use-package prog-mode
    :ensure nil
    :hook
    (prog-mode . display-line-numbers-mode)
    (prog-mode . (lambda () (indent-tabs-mode -1))))
#+end_src

*** Apheleia

Apheleia handles formatting on save across the board.  I've had some trouble with it in the past, so I'm not sold.

#+begin_src emacs-lisp
  (use-package apheleia
    :delight apheleia-mode
    :init (apheleia-global-mode +1)
    :config
    (add-to-list 'apheleia-mode-alist '(heex-ts-mode . mix-format))
    (dolist (mode '(js-ts-mode jsx-ts-mode typescript-ts-mode tsx-ts-mode css-ts-mode css-mode graphql-mode html-mode html-ts-mode js3-mode json-mode json-ts-mode js-json-mode js-mode js-ts-mode scss-mode typescript-mode web-mode yaml-mode yaml-ts-mode markdown-ts-mode markdown-mode toml-ts-mode))
      (setf (alist-get mode apheleia-mode-alist) 'oxfmt)))
#+end_src

*** Rainbow delimiters
This has been causing problems in some modes with deeply nested parens/brackets. I've found I don't really rely on it anymore, so I'm disabling it.  I'm leaving the config in here just in case I decide to use it again later.
#+begin_src emacs-lisp
 ;; (use-package rainbow-delimiters :hook prog-mode)
#+end_src

*** Yasnippet

useful blog post as reference:
 - https://jdhao.github.io/2021/10/06/yasnippet_setup_emacs/
 - http://joaotavora.github.io/yasnippet/snippet-reference.html

#+begin_src emacs-lisp
  (use-package yasnippet
    :delight yas-minor-mode
    :hook ((prog-mode . yas-minor-mode))
    :config
    (setq yas-snippet-dirs '("~/.config/emacs/private-snippets" "~/.config/emacs/snippets"))
    (yas-reload-all))

  ;; https://github.com/AndreaCrotti/yasnippet-snippets
  (use-package yasnippet-snippets :after yasnippet)

#+end_src

*** Imenu
#+begin_src emacs-lisp
  (use-package imenu-list
    :bind ("<f2>" . imenu-list-smart-toggle)
    :custom
    (imenu-list-focus-after-activation t)
    (imenu-max-items nil)          ;; no limit on items
    (imenu-auto-rescan t)          ;; always rescan on buffer change
    (imenu-auto-rescan-maxout 1000000)) ;; allow large buffers
#+end_src

** YAML
#+begin_src emacs-lisp
  (use-package yaml-mode
    :hook (yaml-mode . display-line-numbers-mode))
#+end_src

** Elixir
*** IEx helper functions

Usually, I will have a vterm buffer for my project, and usually it will be running some variation of =iex -S mix=.  When editing an elixir file, it's helpful to be able to send a snippet over to the dedicated iex process and evaluate it.  These custom helper files enable that workflow.

#+begin_src emacs-lisp
  (defun ry/iex-send-string (str)
    "Sends the str to the project's IEx session and executes it."
    (let ((window-config (current-window-configuration)))
      (ry/toggle-project-vterm)
      (with-current-buffer (window-buffer)
        (vterm-reset-cursor-point)
        (let* ((inhibit-read-only t)
               (line-num (line-number-at-pos))
               (last-line (save-excursion
                            (buffer-substring-no-properties
                             (line-beginning-position)
                             (line-end-position)))))
          (if (string-match "^iex" last-line)
              (progn
                (vterm-send-string str t)
                (vterm-send-return))
            (progn
              (message (concat "No IEx session running: " last-line))
              (set-window-configuration window-config)))))))

  (defun ry/elixir-module-at-point ()
    "Return the full nested Elixir module name at point by checking enclosing `defmodule` blocks."
    (interactive)
    (save-excursion
      (let ((modules '())
            (point-pos (point)))
        (goto-char (point-min))
        (while (re-search-forward
                "^\\s-*defmodule\\s-+\\([A-Z][A-Za-z0-9_\\.]*\\)\\s-+do\\b" nil t)
          (let ((module-name (substring-no-properties (match-string 1)))
                (start (match-beginning 0)))
            (condition-case nil
                (let ((end (save-excursion
                             (goto-char start)
                             (forward-sexp) ; move past the module's `do ... end`
                             (point))))
                  (when (and (>= point-pos start)
                             (<= point-pos end))
                    (push module-name modules)))
              (error nil)))) ; skip malformed blocks safely
        (let ((full-name (string-join (reverse modules) ".")))
          (if (called-interactively-p 'interactive)
              (message "%s" full-name)
            (unless (string-empty-p full-name)
              full-name))))))

  (defun ry/iex-reload-module-at-point ()
    "Reload the Elixir module at point in an IEx session using vterm.
  If no IEx session is detected, restore the previous window configuration."
    (interactive)
    (let ((mod (ry/elixir-module-at-point)))
      (if (not mod)
          (message "No Elixir module found at point.")
        (ry/iex-send-string (format "r %s" mod)))))

  (defun ry/iex-send-current-line-or-region ()
    "Insert text of current line or region in IEx and execute."
    (interactive)
    (let* ((current-line (buffer-substring
                          (save-excursion
                            (beginning-of-line)
                            (point))
                          (save-excursion
                            (end-of-line)
                            (point))))
           (buf (current-buffer))
           (command (string-trim
                     (if (use-region-p)
                         (buffer-substring (region-beginning) (region-end))
                       current-line))))
      (ry/iex-send-string command)))
#+end_src

*** Elixir-ts-mode
#+begin_src emacs-lisp
  (use-package elixir-ts-mode
    :hook
    (elixir-ts-mode . mix-minor-mode)
    (elixir-ts-mode . exunit-mode)
    :config (global-subword-mode t)
    :delight subword-mode)
#+end_src

Since the new elixir-ts-mode builds on top of the old elixir-mode, some packages haven't updated yet.  This makes sure everything that elixir-mode did, elixir-ts-mode just inherits.

#+begin_src emacs-lisp
  (add-to-list 'major-mode-remap-alist '(elixir-mode . elixir-ts-mode))
#+end_src

*** Heex-ts-mode
#+begin_src emacs-lisp
  (use-package heex-ts-mode
    :hook
    (heex-ts-mode . display-line-numbers-mode)
    (heex-ts-mode . git-gutter-mode)
    (heex-ts-mode . (lambda () (indent-tabs-mode -1)))
    :init (add-to-list 'auto-mode-alist '("\\.[hl]?eex\\'" . heex-ts-mode)))
#+end_src

*** Mix
#+begin_src emacs-lisp
  (use-package mix
    :delight mix-minor-mode
    :after elixir-ts-mode
    :config (add-hook 'elixir-ts-mode-hook 'mix-minor-mode))
#+end_src

I use mix to run mix tasks, and the output is put in a compilation buffer.

#+begin_src emacs-lisp
  (setq compilation-scroll-output t)
#+end_src

